--- SpeqGCNNet (Random Graph) ---
Input shape: x_magnitude_spec: torch.Size([1, 1, 513, 251]), x_complex_spec: torch.Size([1, 513, 251]), original_len: 128000

SpeqGCNNet Model Summary:
===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
SpeqGCNNet                                    [1, 128000]               --
├─DoubleConv: 1-1                             [1, 64, 513, 251]         --
│    └─Sequential: 2-1                        [1, 64, 513, 251]         --
│    │    └─Conv2d: 3-1                       [1, 64, 513, 251]         640
│    │    └─BatchNorm2d: 3-2                  [1, 64, 513, 251]         128
│    │    └─ReLU: 3-3                         [1, 64, 513, 251]         --
│    │    └─Conv2d: 3-4                       [1, 64, 513, 251]         36,928
│    │    └─BatchNorm2d: 3-5                  [1, 64, 513, 251]         128
│    │    └─ReLU: 3-6                         [1, 64, 513, 251]         --
├─Down: 1-2                                   [1, 128, 256, 125]        --
│    └─Sequential: 2-2                        [1, 128, 256, 125]        --
│    │    └─MaxPool2d: 3-7                    [1, 64, 256, 125]         --
│    │    └─DoubleConv: 3-8                   [1, 128, 256, 125]        221,952
├─Down: 1-3                                   [1, 256, 128, 62]         --
│    └─Sequential: 2-3                        [1, 256, 128, 62]         --
│    │    └─MaxPool2d: 3-9                    [1, 128, 128, 62]         --
│    │    └─DoubleConv: 3-10                  [1, 256, 128, 62]         886,272
├─Down: 1-4                                   [1, 512, 64, 31]          --
│    └─Sequential: 2-4                        [1, 512, 64, 31]          --
│    │    └─MaxPool2d: 3-11                   [1, 256, 64, 31]          --
│    │    └─DoubleConv: 3-12                  [1, 512, 64, 31]          3,542,016
├─GCN: 1-5                                    [1984, 512]               --
│    └─GCNConv: 2-5                           [1984, 32]                32
│    │    └─Linear: 3-13                      [1984, 32]                16,384
│    │    └─SumAggregation: 3-14              [1984, 32]                --
│    └─GCNConv: 2-6                           [1984, 32]                32
│    │    └─Linear: 3-15                      [1984, 32]                1,024
│    │    └─SumAggregation: 3-16              [1984, 32]                --
│    └─GCNConv: 2-7                           [1984, 512]               512
│    │    └─Linear: 3-17                      [1984, 512]               16,384
│    │    └─SumAggregation: 3-18              [1984, 512]               --
├─Up: 1-6                                     [1, 256, 128, 62]         --
│    └─ConvTranspose2d: 2-8                   [1, 256, 128, 62]         524,544
│    └─DoubleConv: 2-9                        [1, 256, 128, 62]         --
│    │    └─Sequential: 3-19                  [1, 256, 128, 62]         1,771,008
├─Up: 1-7                                     [1, 128, 256, 125]        --
│    └─ConvTranspose2d: 2-10                  [1, 128, 256, 124]        131,200
│    └─DoubleConv: 2-11                       [1, 128, 256, 125]        --
│    │    └─Sequential: 3-20                  [1, 128, 256, 125]        443,136
├─Up: 1-8                                     [1, 64, 513, 251]         --
│    └─ConvTranspose2d: 2-12                  [1, 64, 512, 250]         32,832
│    └─DoubleConv: 2-13                       [1, 64, 513, 251]         --
│    │    └─Sequential: 3-21                  [1, 64, 513, 251]         110,976
├─Conv2d: 1-9                                 [1, 1, 513, 251]          65
===============================================================================================
Total params: 7,736,193
Trainable params: 7,736,193
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 81.04
===============================================================================================
Input size (MB): 1.67
Forward/backward pass size (MB): 1076.55
Params size (MB): 30.94
Estimated Total Size (MB): 1109.17
===============================================================================================
SpeqGCNNet Input shape: torch.Size([1, 1, 513, 251]), Output shape: torch.Size([1, 128000])

--- SpeqGATNet (Random Graph, GAT in bottleneck) ---
Input shape: x_magnitude_spec: torch.Size([1, 1, 513, 251]), x_complex_spec: torch.Size([1, 513, 251]), original_len: 128000

SpeqGATNet Model Summary:
===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
SpeqGATNet                                    [1, 128000]               --
├─DoubleConv: 1-1                             [1, 64, 513, 251]         --
│    └─Sequential: 2-1                        [1, 64, 513, 251]         --
│    │    └─Conv2d: 3-1                       [1, 64, 513, 251]         640
│    │    └─BatchNorm2d: 3-2                  [1, 64, 513, 251]         128
│    │    └─ReLU: 3-3                         [1, 64, 513, 251]         --
│    │    └─Conv2d: 3-4                       [1, 64, 513, 251]         36,928
│    │    └─BatchNorm2d: 3-5                  [1, 64, 513, 251]         128
│    │    └─ReLU: 3-6                         [1, 64, 513, 251]         --
├─Down: 1-2                                   [1, 128, 256, 125]        --
│    └─Sequential: 2-2                        [1, 128, 256, 125]        --
│    │    └─MaxPool2d: 3-7                    [1, 64, 256, 125]         --
│    │    └─DoubleConv: 3-8                   [1, 128, 256, 125]        221,952
├─Down: 1-3                                   [1, 256, 128, 62]         --
│    └─Sequential: 2-3                        [1, 256, 128, 62]         --
│    │    └─MaxPool2d: 3-9                    [1, 128, 128, 62]         --
│    │    └─DoubleConv: 3-10                  [1, 256, 128, 62]         886,272
├─Down: 1-4                                   [1, 512, 64, 31]          --
│    └─Sequential: 2-4                        [1, 512, 64, 31]          --
│    │    └─MaxPool2d: 3-11                   [1, 256, 64, 31]          --
│    │    └─DoubleConv: 3-12                  [1, 512, 64, 31]          3,542,016
├─GAT: 1-5                                    [1984, 512]               --
│    └─GATConv: 2-5                           [1984, 128]               384
│    │    └─Linear: 3-13                      [1984, 128]               65,536
│    │    └─SumAggregation: 3-14              [1984, 4, 32]             --
│    └─GATConv: 2-6                           [1984, 128]               384
│    │    └─Linear: 3-15                      [1984, 128]               16,384
│    │    └─SumAggregation: 3-16              [1984, 4, 32]             --
│    └─GATConv: 2-7                           [1984, 512]               1,536
│    │    └─Linear: 3-17                      [1984, 512]               65,536
│    │    └─SumAggregation: 3-18              [1984, 1, 512]            --
├─Up: 1-6                                     [1, 256, 128, 62]         --
│    └─ConvTranspose2d: 2-8                   [1, 256, 128, 62]         524,544
│    └─DoubleConv: 2-9                        [1, 256, 128, 62]         --
│    │    └─Sequential: 3-19                  [1, 256, 128, 62]         1,771,008
├─Up: 1-7                                     [1, 128, 256, 125]        --
│    └─ConvTranspose2d: 2-10                  [1, 128, 256, 124]        131,200
│    └─DoubleConv: 2-11                       [1, 128, 256, 125]        --
│    │    └─Sequential: 3-20                  [1, 128, 256, 125]        443,136
├─Up: 1-8                                     [1, 64, 513, 251]         --
│    └─ConvTranspose2d: 2-12                  [1, 64, 512, 250]         32,832
│    └─DoubleConv: 2-13                       [1, 64, 513, 251]         --
│    │    └─Sequential: 3-21                  [1, 64, 513, 251]         110,976
├─Conv2d: 1-9                                 [1, 1, 513, 251]          65
===============================================================================================
Total params: 7,851,585
Trainable params: 7,851,585
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 81.27
===============================================================================================
Input size (MB): 1.67
Forward/backward pass size (MB): 1079.60
Params size (MB): 31.40
Estimated Total Size (MB): 1112.67
===============================================================================================
SpeqGATNet Input shape: torch.Size([1, 1, 513, 251]), Output shape: torch.Size([1, 128000])

--- SpeqGCNNet2 (k-NN Graph, GCN in bottleneck) ---
Input shape: x_magnitude_spec: torch.Size([1, 1, 513, 251]), x_complex_spec: torch.Size([1, 513, 251]), original_len: 128000

SpeqGCNNet2 Model Summary:
===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
SpeqGCNNet2                                   [1, 128000]               --
├─DoubleConv: 1-1                             [1, 64, 513, 251]         --
│    └─Sequential: 2-1                        [1, 64, 513, 251]         --
│    │    └─Conv2d: 3-1                       [1, 64, 513, 251]         640
│    │    └─BatchNorm2d: 3-2                  [1, 64, 513, 251]         128
│    │    └─ReLU: 3-3                         [1, 64, 513, 251]         --
│    │    └─Conv2d: 3-4                       [1, 64, 513, 251]         36,928
│    │    └─BatchNorm2d: 3-5                  [1, 64, 513, 251]         128
│    │    └─ReLU: 3-6                         [1, 64, 513, 251]         --
├─Down: 1-2                                   [1, 128, 256, 125]        --
│    └─Sequential: 2-2                        [1, 128, 256, 125]        --
│    │    └─MaxPool2d: 3-7                    [1, 64, 256, 125]         --
│    │    └─DoubleConv: 3-8                   [1, 128, 256, 125]        221,952
├─Down: 1-3                                   [1, 256, 128, 62]         --
│    └─Sequential: 2-3                        [1, 256, 128, 62]         --
│    │    └─MaxPool2d: 3-9                    [1, 128, 128, 62]         --
│    │    └─DoubleConv: 3-10                  [1, 256, 128, 62]         886,272
├─Down: 1-4                                   [1, 512, 64, 31]          --
│    └─Sequential: 2-4                        [1, 512, 64, 31]          --
│    │    └─MaxPool2d: 3-11                   [1, 256, 64, 31]          --
│    │    └─DoubleConv: 3-12                  [1, 512, 64, 31]          3,542,016
├─GCN: 1-5                                    [1984, 512]               --
│    └─GCNConv: 2-5                           [1984, 32]                32
│    │    └─Linear: 3-13                      [1984, 32]                16,384
│    │    └─SumAggregation: 3-14              [1984, 32]                --
│    └─GCNConv: 2-6                           [1984, 32]                32
│    │    └─Linear: 3-15                      [1984, 32]                1,024
│    │    └─SumAggregation: 3-16              [1984, 32]                --
│    └─GCNConv: 2-7                           [1984, 512]               512
│    │    └─Linear: 3-17                      [1984, 512]               16,384
│    │    └─SumAggregation: 3-18              [1984, 512]               --
├─Up: 1-6                                     [1, 256, 128, 62]         --
│    └─ConvTranspose2d: 2-8                   [1, 256, 128, 62]         524,544
│    └─DoubleConv: 2-9                        [1, 256, 128, 62]         --
│    │    └─Sequential: 3-19                  [1, 256, 128, 62]         1,771,008
├─Up: 1-7                                     [1, 128, 256, 125]        --
│    └─ConvTranspose2d: 2-10                  [1, 128, 256, 124]        131,200
│    └─DoubleConv: 2-11                       [1, 128, 256, 125]        --
│    │    └─Sequential: 3-20                  [1, 128, 256, 125]        443,136
├─Up: 1-8                                     [1, 64, 513, 251]         --
│    └─ConvTranspose2d: 2-12                  [1, 64, 512, 250]         32,832
│    └─DoubleConv: 2-13                       [1, 64, 513, 251]         --
│    │    └─Sequential: 3-21                  [1, 64, 513, 251]         110,976
├─Conv2d: 1-9                                 [1, 1, 513, 251]          65
===============================================================================================
Total params: 7,736,193
Trainable params: 7,736,193
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 81.04
===============================================================================================
Input size (MB): 1.67
Forward/backward pass size (MB): 1076.55
Params size (MB): 30.94
Estimated Total Size (MB): 1109.17
===============================================================================================
SpeqGCNNet2 Input shape: torch.Size([1, 1, 513, 251]), Output shape: torch.Size([1, 128000])

--- SpeqGATNet2 (k-NN Graph, GAT in bottleneck) ---
Input shape: x_magnitude_spec: torch.Size([1, 1, 513, 251]), x_complex_spec: torch.Size([1, 513, 251]), original_len: 128000

SpeqGATNet2 Model Summary:
===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
SpeqGATNet2                                   [1, 128000]               --
├─DoubleConv: 1-1                             [1, 64, 513, 251]         --
│    └─Sequential: 2-1                        [1, 64, 513, 251]         --
│    │    └─Conv2d: 3-1                       [1, 64, 513, 251]         640
│    │    └─BatchNorm2d: 3-2                  [1, 64, 513, 251]         128
│    │    └─ReLU: 3-3                         [1, 64, 513, 251]         --
│    │    └─Conv2d: 3-4                       [1, 64, 513, 251]         36,928
│    │    └─BatchNorm2d: 3-5                  [1, 64, 513, 251]         128
│    │    └─ReLU: 3-6                         [1, 64, 513, 251]         --
├─Down: 1-2                                   [1, 128, 256, 125]        --
│    └─Sequential: 2-2                        [1, 128, 256, 125]        --
│    │    └─MaxPool2d: 3-7                    [1, 64, 256, 125]         --
│    │    └─DoubleConv: 3-8                   [1, 128, 256, 125]        221,952
├─Down: 1-3                                   [1, 256, 128, 62]         --
│    └─Sequential: 2-3                        [1, 256, 128, 62]         --
│    │    └─MaxPool2d: 3-9                    [1, 128, 128, 62]         --
│    │    └─DoubleConv: 3-10                  [1, 256, 128, 62]         886,272
├─Down: 1-4                                   [1, 512, 64, 31]          --
│    └─Sequential: 2-4                        [1, 512, 64, 31]          --
│    │    └─MaxPool2d: 3-11                   [1, 256, 64, 31]          --
│    │    └─DoubleConv: 3-12                  [1, 512, 64, 31]          3,542,016
├─GAT: 1-5                                    [1984, 512]               --
│    └─GATConv: 2-5                           [1984, 128]               384
│    │    └─Linear: 3-13                      [1984, 128]               65,536
│    │    └─SumAggregation: 3-14              [1984, 4, 32]             --
│    └─GATConv: 2-6                           [1984, 128]               384
│    │    └─Linear: 3-15                      [1984, 128]               16,384
│    │    └─SumAggregation: 3-16              [1984, 4, 32]             --
│    └─GATConv: 2-7                           [1984, 512]               1,536
│    │    └─Linear: 3-17                      [1984, 512]               65,536
│    │    └─SumAggregation: 3-18              [1984, 1, 512]            --
├─Up: 1-6                                     [1, 256, 128, 62]         --
│    └─ConvTranspose2d: 2-8                   [1, 256, 128, 62]         524,544
│    └─DoubleConv: 2-9                        [1, 256, 128, 62]         --
│    │    └─Sequential: 3-19                  [1, 256, 128, 62]         1,771,008
├─Up: 1-7                                     [1, 128, 256, 125]        --
│    └─ConvTranspose2d: 2-10                  [1, 128, 256, 124]        131,200
│    └─DoubleConv: 2-11                       [1, 128, 256, 125]        --
│    │    └─Sequential: 3-20                  [1, 128, 256, 125]        443,136
├─Up: 1-8                                     [1, 64, 513, 251]         --
│    └─ConvTranspose2d: 2-12                  [1, 64, 512, 250]         32,832
│    └─DoubleConv: 2-13                       [1, 64, 513, 251]         --
│    │    └─Sequential: 3-21                  [1, 64, 513, 251]         110,976
├─Conv2d: 1-9                                 [1, 1, 513, 251]          65
===============================================================================================
Total params: 7,851,585
Trainable params: 7,851,585
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 81.27
===============================================================================================
Input size (MB): 1.67
Forward/backward pass size (MB): 1079.60
Params size (MB): 31.40
Estimated Total Size (MB): 1112.67
===============================================================================================
SpeqGATNet2 Input shape: torch.Size([1, 1, 513, 251]), Output shape: torch.Size([1, 128000])

GPU Memory Usage (after initializations):
Allocated: 2740.93 MB
Cached: 2870.00 MB