--- UGCNNet (Random Graph) ---
C:\Users\kataoka-lab\anaconda3\envs\GNN_RelNet\Lib\site-packages\torch\nn\modules\module.py:1329: UserWarning: expandable_segments not supported on this platform (Triggered internally at C:\actions-runner\_work\pytorch\pytorch\pytorch\c10/cuda/CUDAAllocatorConfig.h:28.)
  return t.to(

UGCNNet Model Summary:
===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
UGCNNet                                       [1, 1, 128000]            --
├─Conv1d: 1-1                                 [1, 512, 3999]            32,768
├─DoubleConv: 1-2                             [1, 64, 512, 3999]        --
│    └─Sequential: 2-1                        [1, 64, 512, 3999]        --
│    │    └─Conv2d: 3-1                       [1, 64, 512, 3999]        640
│    │    └─BatchNorm2d: 3-2                  [1, 64, 512, 3999]        128
│    │    └─ReLU: 3-3                         [1, 64, 512, 3999]        --
│    │    └─Conv2d: 3-4                       [1, 64, 512, 3999]        36,928
│    │    └─BatchNorm2d: 3-5                  [1, 64, 512, 3999]        128
│    │    └─ReLU: 3-6                         [1, 64, 512, 3999]        --
├─Down: 1-3                                   [1, 128, 256, 1999]       --
│    └─Sequential: 2-2                        [1, 128, 256, 1999]       --
│    │    └─MaxPool2d: 3-7                    [1, 64, 256, 1999]        --
│    │    └─DoubleConv: 3-8                   [1, 128, 256, 1999]       221,952
├─Down: 1-4                                   [1, 256, 128, 999]        --
│    └─Sequential: 2-3                        [1, 256, 128, 999]        --
│    │    └─MaxPool2d: 3-9                    [1, 128, 128, 999]        --
│    │    └─DoubleConv: 3-10                  [1, 256, 128, 999]        886,272
├─Down: 1-5                                   [1, 512, 64, 499]         --
│    └─Sequential: 2-4                        [1, 512, 64, 499]         --
│    │    └─MaxPool2d: 3-11                   [1, 256, 64, 499]         --
│    │    └─DoubleConv: 3-12                  [1, 512, 64, 499]         3,542,016
├─GCN: 1-6                                    [31936, 512]              --
│    └─GCNConv: 2-5                           [31936, 32]               32
│    │    └─Linear: 3-13                      [31936, 32]               16,384
│    │    └─SumAggregation: 3-14              [31936, 32]               --
│    └─GCNConv: 2-6                           [31936, 32]               32
│    │    └─Linear: 3-15                      [31936, 32]               1,024
│    │    └─SumAggregation: 3-16              [31936, 32]               --
│    └─GCNConv: 2-7                           [31936, 512]              512
│    │    └─Linear: 3-17                      [31936, 512]              16,384
│    │    └─SumAggregation: 3-18              [31936, 512]              --
├─Up: 1-7                                     [1, 256, 128, 999]        --
│    └─ConvTranspose2d: 2-8                   [1, 256, 128, 998]        524,544
│    └─DoubleConv: 2-9                        [1, 256, 128, 999]        --
│    │    └─Sequential: 3-19                  [1, 256, 128, 999]        1,771,008
├─Up: 1-8                                     [1, 128, 256, 1999]       --
│    └─ConvTranspose2d: 2-10                  [1, 128, 256, 1998]       131,200
│    └─DoubleConv: 2-11                       [1, 128, 256, 1999]       --
│    │    └─Sequential: 3-20                  [1, 128, 256, 1999]       443,136
├─Up: 1-9                                     [1, 64, 512, 3999]        --
│    └─ConvTranspose2d: 2-12                  [1, 64, 512, 3998]        32,832
│    └─DoubleConv: 2-13                       [1, 64, 512, 3999]        --
│    │    └─Sequential: 3-21                  [1, 64, 512, 3999]        110,976
├─Conv2d: 1-10                                [1, 1, 512, 3999]         65
├─ConvTranspose1d: 1-11                       [1, 1, 128000]            32,768
===============================================================================================
Total params: 7,801,729
Trainable params: 7,801,729
Non-trainable params: 0
Total mult-adds (Units.TERABYTES): 1.30
===============================================================================================
Input size (MB): 0.51
Forward/backward pass size (MB): 17211.39
Params size (MB): 31.20
Estimated Total Size (MB): 17243.11
===============================================================================================
UGCNNet Input shape: torch.Size([1, 1, 128000]), Output shape: torch.Size([1, 1, 128000])

--- UGATNet (Random Graph, GAT in bottleneck) ---

UGATNet Model Summary:
===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
UGATNet                                       [1, 1, 128000]            --
├─Conv1d: 1-1                                 [1, 512, 3999]            32,768
├─DoubleConv: 1-2                             [1, 64, 512, 3999]        --
│    └─Sequential: 2-1                        [1, 64, 512, 3999]        --
│    │    └─Conv2d: 3-1                       [1, 64, 512, 3999]        640
│    │    └─BatchNorm2d: 3-2                  [1, 64, 512, 3999]        128
│    │    └─ReLU: 3-3                         [1, 64, 512, 3999]        --
│    │    └─Conv2d: 3-4                       [1, 64, 512, 3999]        36,928
│    │    └─BatchNorm2d: 3-5                  [1, 64, 512, 3999]        128
│    │    └─ReLU: 3-6                         [1, 64, 512, 3999]        --
├─Down: 1-3                                   [1, 128, 256, 1999]       --
│    └─Sequential: 2-2                        [1, 128, 256, 1999]       --
│    │    └─MaxPool2d: 3-7                    [1, 64, 256, 1999]        --
│    │    └─DoubleConv: 3-8                   [1, 128, 256, 1999]       221,952
├─Down: 1-4                                   [1, 256, 128, 999]        --
│    └─Sequential: 2-3                        [1, 256, 128, 999]        --
│    │    └─MaxPool2d: 3-9                    [1, 128, 128, 999]        --
│    │    └─DoubleConv: 3-10                  [1, 256, 128, 999]        886,272
├─Down: 1-5                                   [1, 512, 64, 499]         --
│    └─Sequential: 2-4                        [1, 512, 64, 499]         --
│    │    └─MaxPool2d: 3-11                   [1, 256, 64, 499]         --
│    │    └─DoubleConv: 3-12                  [1, 512, 64, 499]         3,542,016
├─GAT: 1-6                                    [31936, 512]              --
│    └─GATConv: 2-5                           [31936, 128]              384
│    │    └─Linear: 3-13                      [31936, 128]              65,536
│    │    └─SumAggregation: 3-14              [31936, 4, 32]            --
│    └─GATConv: 2-6                           [31936, 128]              384
│    │    └─Linear: 3-15                      [31936, 128]              16,384
│    │    └─SumAggregation: 3-16              [31936, 4, 32]            --
│    └─GATConv: 2-7                           [31936, 512]              1,536
│    │    └─Linear: 3-17                      [31936, 512]              65,536
│    │    └─SumAggregation: 3-18              [31936, 1, 512]           --
├─Up: 1-7                                     [1, 256, 128, 999]        --
│    └─ConvTranspose2d: 2-8                   [1, 256, 128, 998]        524,544
│    └─DoubleConv: 2-9                        [1, 256, 128, 999]        --
│    │    └─Sequential: 3-19                  [1, 256, 128, 999]        1,771,008
│    │    └─SumAggregation: 3-14              [31936, 4, 32]            --
│    └─GATConv: 2-6                           [31936, 128]              384
│    │    └─Linear: 3-15                      [31936, 128]              16,384
│    │    └─SumAggregation: 3-16              [31936, 4, 32]            --
│    └─GATConv: 2-7                           [31936, 512]              1,536
│    │    └─Linear: 3-17                      [31936, 512]              65,536
│    │    └─SumAggregation: 3-18              [31936, 1, 512]           --
├─Up: 1-7                                     [1, 256, 128, 999]        --
│    └─ConvTranspose2d: 2-8                   [1, 256, 128, 998]        524,544
│    └─DoubleConv: 2-9                        [1, 256, 128, 999]        --
│    │    └─Sequential: 3-19                  [1, 256, 128, 999]        1,771,008
│    │    └─Linear: 3-17                      [31936, 512]              65,536
│    │    └─SumAggregation: 3-18              [31936, 1, 512]           --
├─Up: 1-7                                     [1, 256, 128, 999]        --
│    └─ConvTranspose2d: 2-8                   [1, 256, 128, 998]        524,544
│    └─DoubleConv: 2-9                        [1, 256, 128, 999]        --
│    │    └─Sequential: 3-19                  [1, 256, 128, 999]        1,771,008
│    │    └─SumAggregation: 3-18              [31936, 1, 512]           --
├─Up: 1-7                                     [1, 256, 128, 999]        --
│    └─ConvTranspose2d: 2-8                   [1, 256, 128, 998]        524,544
│    └─DoubleConv: 2-9                        [1, 256, 128, 999]        --
│    │    └─Sequential: 3-19                  [1, 256, 128, 999]        1,771,008
│    └─ConvTranspose2d: 2-8                   [1, 256, 128, 998]        524,544
│    └─DoubleConv: 2-9                        [1, 256, 128, 999]        --
│    │    └─Sequential: 3-19                  [1, 256, 128, 999]        1,771,008
│    └─DoubleConv: 2-9                        [1, 256, 128, 999]        --
│    │    └─Sequential: 3-19                  [1, 256, 128, 999]        1,771,008
├─Up: 1-8                                     [1, 128, 256, 1999]       --
├─Up: 1-8                                     [1, 128, 256, 1999]       --
│    └─ConvTranspose2d: 2-10                  [1, 128, 256, 1998]       131,200
│    └─DoubleConv: 2-11                       [1, 128, 256, 1999]       --
│    │    └─Sequential: 3-20                  [1, 128, 256, 1999]       443,136
│    │    └─Sequential: 3-20                  [1, 128, 256, 1999]       443,136
├─Up: 1-9                                     [1, 64, 512, 3999]        --
├─Up: 1-9                                     [1, 64, 512, 3999]        --
│    └─ConvTranspose2d: 2-12                  [1, 64, 512, 3998]        32,832
│    └─DoubleConv: 2-13                       [1, 64, 512, 3999]        --
│    │    └─Sequential: 3-21                  [1, 64, 512, 3999]        110,976
├─Conv2d: 1-10                                [1, 1, 512, 3999]         65
├─ConvTranspose1d: 1-11                       [1, 1, 128000]            32,768
===============================================================================================
Total params: 7,917,121
Trainable params: 7,917,121
Trainable params: 7,917,121
Non-trainable params: 0
Total mult-adds (Units.TERABYTES): 1.31
===============================================================================================
Input size (MB): 0.51
Forward/backward pass size (MB): 17260.45
Params size (MB): 31.66
Estimated Total Size (MB): 17292.62
===============================================================================================
UGATNet Input shape: torch.Size([1, 1, 128000]), Output shape: torch.Size([1, 1, 128000])

--- UGCNNet2 (k-NN Graph, GCN in bottleneck) ---

UGCNNet2 Model Summary:
===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
UGCNNet2                                      [1, 1, 128000]            --
├─Conv1d: 1-1                                 [1, 512, 3999]            32,768
├─DoubleConv: 1-2                             [1, 64, 512, 3999]        --
│    └─Sequential: 2-1                        [1, 64, 512, 3999]        --
│    │    └─Conv2d: 3-1                       [1, 64, 512, 3999]        640
│    │    └─BatchNorm2d: 3-2                  [1, 64, 512, 3999]        128
│    │    └─ReLU: 3-3                         [1, 64, 512, 3999]        --
│    │    └─Conv2d: 3-4                       [1, 64, 512, 3999]        36,928
│    │    └─BatchNorm2d: 3-5                  [1, 64, 512, 3999]        128
│    │    └─ReLU: 3-6                         [1, 64, 512, 3999]        --
├─Down: 1-3                                   [1, 128, 256, 1999]       --
│    └─Sequential: 2-2                        [1, 128, 256, 1999]       --
│    │    └─MaxPool2d: 3-7                    [1, 64, 256, 1999]        --
│    │    └─DoubleConv: 3-8                   [1, 128, 256, 1999]       221,952
├─Down: 1-4                                   [1, 256, 128, 999]        --
│    └─Sequential: 2-3                        [1, 256, 128, 999]        --
│    │    └─MaxPool2d: 3-9                    [1, 128, 128, 999]        --
│    │    └─DoubleConv: 3-10                  [1, 256, 128, 999]        886,272
├─Down: 1-5                                   [1, 512, 64, 499]         --
│    └─Sequential: 2-4                        [1, 512, 64, 499]         --
│    │    └─MaxPool2d: 3-11                   [1, 256, 64, 499]         --
│    │    └─DoubleConv: 3-12                  [1, 512, 64, 499]         3,542,016
├─GCN: 1-6                                    [31936, 512]              --
│    └─GCNConv: 2-5                           [31936, 32]               32
│    │    └─Linear: 3-13                      [31936, 32]               16,384
│    │    └─SumAggregation: 3-14              [31936, 32]               --
│    └─GCNConv: 2-6                           [31936, 32]               32
│    │    └─Linear: 3-15                      [31936, 32]               1,024
│    │    └─SumAggregation: 3-16              [31936, 32]               --
│    └─GCNConv: 2-7                           [31936, 512]              512
│    │    └─Linear: 3-17                      [31936, 512]              16,384
│    │    └─SumAggregation: 3-18              [31936, 512]              --
├─Up: 1-7                                     [1, 256, 128, 999]        --
│    └─ConvTranspose2d: 2-8                   [1, 256, 128, 998]        524,544
│    └─DoubleConv: 2-9                        [1, 256, 128, 999]        --
│    │    └─Sequential: 3-19                  [1, 256, 128, 999]        1,771,008
├─Up: 1-8                                     [1, 128, 256, 1999]       --
│    └─ConvTranspose2d: 2-10                  [1, 128, 256, 1998]       131,200
│    └─DoubleConv: 2-11                       [1, 128, 256, 1999]       --
│    │    └─Sequential: 3-20                  [1, 128, 256, 1999]       443,136
├─Up: 1-9                                     [1, 64, 512, 3999]        --
│    └─ConvTranspose2d: 2-12                  [1, 64, 512, 3998]        32,832
│    └─DoubleConv: 2-13                       [1, 64, 512, 3999]        --
│    │    └─Sequential: 3-21                  [1, 64, 512, 3999]        110,976
├─Conv2d: 1-10                                [1, 1, 512, 3999]         65
├─ConvTranspose1d: 1-11                       [1, 1, 128000]            32,768
===============================================================================================
Total params: 7,801,729
Trainable params: 7,801,729
Non-trainable params: 0
Total mult-adds (Units.TERABYTES): 1.30
===============================================================================================
Input size (MB): 0.51
Forward/backward pass size (MB): 17211.39
Params size (MB): 31.20
Estimated Total Size (MB): 17243.11
===============================================================================================
UGCNNet2 Input shape: torch.Size([1, 1, 128000]), Output shape: torch.Size([1, 1, 128000])

--- UGATNet2 (k-NN Graph, GAT in bottleneck) ---

UGATNet2 Model Summary:
===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
UGATNet2                                      [1, 1, 128000]            --
├─Conv1d: 1-1                                 [1, 512, 3999]            32,768
├─DoubleConv: 1-2                             [1, 64, 512, 3999]        --
│    └─Sequential: 2-1                        [1, 64, 512, 3999]        --
│    │    └─Conv2d: 3-1                       [1, 64, 512, 3999]        640
│    │    └─BatchNorm2d: 3-2                  [1, 64, 512, 3999]        128
│    │    └─ReLU: 3-3                         [1, 64, 512, 3999]        --
│    │    └─Conv2d: 3-4                       [1, 64, 512, 3999]        36,928
│    │    └─BatchNorm2d: 3-5                  [1, 64, 512, 3999]        128
│    │    └─ReLU: 3-6                         [1, 64, 512, 3999]        --
├─Down: 1-3                                   [1, 128, 256, 1999]       --
│    └─Sequential: 2-2                        [1, 128, 256, 1999]       --
│    │    └─MaxPool2d: 3-7                    [1, 64, 256, 1999]        --
│    │    └─DoubleConv: 3-8                   [1, 128, 256, 1999]       221,952
├─Down: 1-4                                   [1, 256, 128, 999]        --
│    └─Sequential: 2-3                        [1, 256, 128, 999]        --
│    │    └─MaxPool2d: 3-9                    [1, 128, 128, 999]        --
│    │    └─DoubleConv: 3-10                  [1, 256, 128, 999]        886,272
├─Down: 1-5                                   [1, 512, 64, 499]         --
│    └─Sequential: 2-4                        [1, 512, 64, 499]         --
│    │    └─MaxPool2d: 3-11                   [1, 256, 64, 499]         --
│    │    └─DoubleConv: 3-12                  [1, 512, 64, 499]         3,542,016
├─GAT: 1-6                                    [31936, 512]              --
│    └─GATConv: 2-5                           [31936, 128]              384
│    │    └─Linear: 3-13                      [31936, 128]              65,536
│    │    └─SumAggregation: 3-14              [31936, 4, 32]            --
│    └─GATConv: 2-6                           [31936, 128]              384
│    │    └─Linear: 3-15                      [31936, 128]              16,384
│    │    └─SumAggregation: 3-16              [31936, 4, 32]            --
│    └─GATConv: 2-7                           [31936, 512]              1,536
│    │    └─Linear: 3-17                      [31936, 512]              65,536
│    │    └─SumAggregation: 3-18              [31936, 1, 512]           --
├─Up: 1-7                                     [1, 256, 128, 999]        --
│    └─ConvTranspose2d: 2-8                   [1, 256, 128, 998]        524,544
│    └─DoubleConv: 2-9                        [1, 256, 128, 999]        --
│    │    └─Sequential: 3-19                  [1, 256, 128, 999]        1,771,008
├─Up: 1-8                                     [1, 128, 256, 1999]       --
│    └─ConvTranspose2d: 2-10                  [1, 128, 256, 1998]       131,200
│    └─DoubleConv: 2-11                       [1, 128, 256, 1999]       --
│    │    └─Sequential: 3-20                  [1, 128, 256, 1999]       443,136
├─Up: 1-9                                     [1, 64, 512, 3999]        --
│    └─ConvTranspose2d: 2-12                  [1, 64, 512, 3998]        32,832
│    └─DoubleConv: 2-13                       [1, 64, 512, 3999]        --
│    │    └─Sequential: 3-21                  [1, 64, 512, 3999]        110,976
├─Conv2d: 1-10                                [1, 1, 512, 3999]         65
├─ConvTranspose1d: 1-11                       [1, 1, 128000]            32,768
===============================================================================================
Total params: 7,917,121
Trainable params: 7,917,121
Non-trainable params: 0
Total mult-adds (Units.TERABYTES): 1.31
===============================================================================================
Input size (MB): 0.51
Forward/backward pass size (MB): 17260.45
Params size (MB): 31.66
Estimated Total Size (MB): 17292.62
===============================================================================================